stevenj/avr-libc3/include/avr/io/attiny102.h
/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-on Reset Flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-on Reset Flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-on Reset Flag - SET */
} CPU_PORF_t;

/* Non-Volatile Memory Busy */
typedef enum CPU_NVMBSY_enum
{
    CPU_NVMBSY_CLEAR_gc = (0x00), /* Non-Volatile Memory Busy - CLEAR */
    CPU_NVMBSY_SET_gc   = (0x80), /* Non-Volatile Memory Busy - SET */
} CPU_NVMBSY_t;

/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTB_struct
{
    register8_t rsv_0x00[4];  /* RESERVED REGISTER BLOCK */
    register8_t PINB;         /* Input Pins, Port B */
    register8_t DDRB;         /* Data Direction Register, Port B */
    register8_t PORTB;        /* Port B Data register */
    register8_t PUEB;         /* Pull-up Enable Control Register for PORTB */
    register8_t rsv_0x08[14]; /* RESERVED REGISTER BLOCK */
    register8_t PORTCR;       /* Port Control Register */
} PORTB_t;


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTA_struct
{
    register8_t PINA;         /* Input Pins, Port A */
    register8_t DDRA;         /* Data Direction Register, Port A */
    register8_t PORTA;        /* Port A Data register */
    register8_t PUEA;         /* Pull-up Enable Control Register for PORTA */
    register8_t rsv_0x04[18]; /* RESERVED REGISTER BLOCK */
    register8_t PORTCR;       /* Port Control Register */
} PORTA_t;


/* Break-Before-Make Mode Enable for PORTB */
typedef enum PORTB_BBMB_enum
{
    PORTB_BBMB_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable for PORTB - CLEAR */
    PORTB_BBMB_SET_gc   = (0x02), /* Break-Before-Make Mode Enable for PORTB - SET */
} PORTB_BBMB_t;

/* Break-Before-Make Mode Enable for PORTA */
typedef enum PORTA_BBMA_enum
{
    PORTA_BBMA_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable for PORTA - CLEAR */
    PORTA_BBMA_SET_gc   = (0x01), /* Break-Before-Make Mode Enable for PORTA - SET */
} PORTA_BBMA_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[15]; /* RESERVED REGISTER BLOCK */
    register8_t PCMSK0;       /* Pin Change Mask Register 0 */
    register8_t PCMSK1;       /* Pin Change Mask Register 1 */
    register8_t PCIFR;        /* Pin Change Interrupt Flag Register */
    register8_t PCICR;        /* Pin Change Interrupt Control Register */
    register8_t EIMSK;        /* External Interrupt Mask register */
    register8_t EIFR;         /* External Interrupt Flag register */
    register8_t EICRA;        /* External Interrupt Control Register A */
} EXINT_t;


/* Interrupt Sense Control 0 Bit 1 */
typedef enum EXINT_ISC01_enum
{
    EXINT_ISC01_CLEAR_gc = (0x00), /* Interrupt Sense Control 0 Bit 1 - CLEAR */
    EXINT_ISC01_SET_gc   = (0x02), /* Interrupt Sense Control 0 Bit 1 - SET */
} EXINT_ISC01_t;

/* Interrupt Sense Control 0 Bit 0 */
typedef enum EXINT_ISC00_enum
{
    EXINT_ISC00_CLEAR_gc = (0x00), /* Interrupt Sense Control 0 Bit 0 - CLEAR */
    EXINT_ISC00_SET_gc   = (0x01), /* Interrupt Sense Control 0 Bit 0 - SET */
} EXINT_ISC00_t;

/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x01), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x01), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;

/* Pin Change Interrupt Enable 1 */
typedef enum EXINT_PCIE1_enum
{
    EXINT_PCIE1_CLEAR_gc = (0x00), /* Pin Change Interrupt Enable 1 - CLEAR */
    EXINT_PCIE1_SET_gc   = (0x02), /* Pin Change Interrupt Enable 1 - SET */
} EXINT_PCIE1_t;

/* Pin Change Interrupt Enable 0 */
typedef enum EXINT_PCIE0_enum
{
    EXINT_PCIE0_CLEAR_gc = (0x00), /* Pin Change Interrupt Enable 0 - CLEAR */
    EXINT_PCIE0_SET_gc   = (0x01), /* Pin Change Interrupt Enable 0 - SET */
} EXINT_PCIE0_t;

/* Pin Change Interrupt Flag 1 */
typedef enum EXINT_PCIF1_enum
{
    EXINT_PCIF1_CLEAR_gc = (0x00), /* Pin Change Interrupt Flag 1 - CLEAR */
    EXINT_PCIF1_SET_gc   = (0x02), /* Pin Change Interrupt Flag 1 - SET */
} EXINT_PCIF1_t;

/* Pin Change Interrupt Flag 0 */
typedef enum EXINT_PCIF0_enum
{
    EXINT_PCIF0_CLEAR_gc = (0x00), /* Pin Change Interrupt Flag 0 - CLEAR */
    EXINT_PCIF0_SET_gc   = (0x01), /* Pin Change Interrupt Flag 0 - SET */
} EXINT_PCIF0_t;

/* Pin Change Enable Mask 1 Bit 3 */
typedef enum EXINT_PCINT11_enum
{
    EXINT_PCINT11_CLEAR_gc = (0x00), /* Pin Change Enable Mask 1 Bit 3 - CLEAR */
    EXINT_PCINT11_SET_gc   = (0x08), /* Pin Change Enable Mask 1 Bit 3 - SET */
} EXINT_PCINT11_t;

/* Pin Change Enable Mask 1 Bit 2 */
typedef enum EXINT_PCINT10_enum
{
    EXINT_PCINT10_CLEAR_gc = (0x00), /* Pin Change Enable Mask 1 Bit 2 - CLEAR */
    EXINT_PCINT10_SET_gc   = (0x04), /* Pin Change Enable Mask 1 Bit 2 - SET */
} EXINT_PCINT10_t;

/* Pin Change Enable Mask 1 Bit 1 */
typedef enum EXINT_PCINT9_enum
{
    EXINT_PCINT9_CLEAR_gc = (0x00), /* Pin Change Enable Mask 1 Bit 1 - CLEAR */
    EXINT_PCINT9_SET_gc   = (0x02), /* Pin Change Enable Mask 1 Bit 1 - SET */
} EXINT_PCINT9_t;

/* Pin Change Enable Mask 1 Bit 0 */
typedef enum EXINT_PCINT8_enum
{
    EXINT_PCINT8_CLEAR_gc = (0x00), /* Pin Change Enable Mask 1 Bit 0 - CLEAR */
    EXINT_PCINT8_SET_gc   = (0x01), /* Pin Change Enable Mask 1 Bit 0 - SET */
} EXINT_PCINT8_t;

/* Pin Change Enable Mask 0 Bit 7 */
typedef enum EXINT_PCINT7_enum
{
    EXINT_PCINT7_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 7 - CLEAR */
    EXINT_PCINT7_SET_gc   = (0x80), /* Pin Change Enable Mask 0 Bit 7 - SET */
} EXINT_PCINT7_t;

