stevenj/avr-libc3/include/avr/io/attiny102.h
/* Pin Change Enable Mask 0 Bit 6 */
typedef enum EXINT_PCINT6_enum
{
    EXINT_PCINT6_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 6 - CLEAR */
    EXINT_PCINT6_SET_gc   = (0x40), /* Pin Change Enable Mask 0 Bit 6 - SET */
} EXINT_PCINT6_t;

/* Pin Change Enable Mask 0 Bit 5 */
typedef enum EXINT_PCINT5_enum
{
    EXINT_PCINT5_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 5 - CLEAR */
    EXINT_PCINT5_SET_gc   = (0x20), /* Pin Change Enable Mask 0 Bit 5 - SET */
} EXINT_PCINT5_t;

/* Pin Change Enable Mask 0 Bit 4 */
typedef enum EXINT_PCINT4_enum
{
    EXINT_PCINT4_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 4 - CLEAR */
    EXINT_PCINT4_SET_gc   = (0x10), /* Pin Change Enable Mask 0 Bit 4 - SET */
} EXINT_PCINT4_t;

/* Pin Change Enable Mask 0 Bit 3 */
typedef enum EXINT_PCINT3_enum
{
    EXINT_PCINT3_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 3 - CLEAR */
    EXINT_PCINT3_SET_gc   = (0x08), /* Pin Change Enable Mask 0 Bit 3 - SET */
} EXINT_PCINT3_t;

/* Pin Change Enable Mask 0 Bit 2 */
typedef enum EXINT_PCINT2_enum
{
    EXINT_PCINT2_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 2 - CLEAR */
    EXINT_PCINT2_SET_gc   = (0x04), /* Pin Change Enable Mask 0 Bit 2 - SET */
} EXINT_PCINT2_t;

/* Pin Change Enable Mask 0 Bit 1 */
typedef enum EXINT_PCINT1_enum
{
    EXINT_PCINT1_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 1 - CLEAR */
    EXINT_PCINT1_SET_gc   = (0x02), /* Pin Change Enable Mask 0 Bit 1 - SET */
} EXINT_PCINT1_t;

/* Pin Change Enable Mask 0 Bit 0 */
typedef enum EXINT_PCINT0_enum
{
    EXINT_PCINT0_CLEAR_gc = (0x00), /* Pin Change Enable Mask 0 Bit 0 - CLEAR */
    EXINT_PCINT0_SET_gc   = (0x01), /* Pin Change Enable Mask 0 Bit 0 - SET */
} EXINT_PCINT0_t;

/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[34]; /* RESERVED REGISTER BLOCK */
    _REGISTER16 (ICR0);       /* Input Capture Register  Bytes */
    register8_t rsv_0x23;     /* RESERVED REGISTER */
    _REGISTER16 (OCR0B);      /* Timer/Counter0 Output Compare Register B  */
    register8_t rsv_0x25;     /* RESERVED REGISTER */
    _REGISTER16 (OCR0A);      /* Timer/Counter 0 Output Compare Register A  */
    register8_t rsv_0x27;     /* RESERVED REGISTER */
    _REGISTER16 (TCNT0);      /* Timer/Counter0  */
    register8_t rsv_0x29;     /* RESERVED REGISTER */
    register8_t TIFR0;        /* Overflow Interrupt Enable */
    register8_t TIMSK0;       /* Timer Interrupt Mask Register 0 */
    register8_t TCCR0C;       /* Timer/Counter 0 Control Register C */
    register8_t TCCR0B;       /* Timer/Counter 0 Control Register B */
    register8_t TCCR0A;       /* Timer/Counter 0 Control Register A */
    register8_t GTCCR;        /* General Timer/Counter Control Register */
} TC0_t;


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Input Capture Noise Canceler */
typedef enum TC0_ICNC0_enum
{
    TC0_ICNC0_CLEAR_gc = (0x00), /* Input Capture Noise Canceler - CLEAR */
    TC0_ICNC0_SET_gc   = (0x80), /* Input Capture Noise Canceler - SET */
} TC0_ICNC0_t;

/* Input Capture Edge Select */
typedef enum TC0_ICES0_enum
{
    TC0_ICES0_CLEAR_gc = (0x00), /* Input Capture Edge Select - CLEAR */
    TC0_ICES0_SET_gc   = (0x40), /* Input Capture Edge Select - SET */
} TC0_ICES0_t;

/* Waveform Generation Mode */
#define TC0_TCCR0B_WGM0_gc(x) ((x<<3) & 0x18)

/* Clock Select */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Force Output Compare for Channel A */
typedef enum TC0_FOC0A_enum
{
    TC0_FOC0A_CLEAR_gc = (0x00), /* Force Output Compare for Channel A - CLEAR */
    TC0_FOC0A_SET_gc   = (0x80), /* Force Output Compare for Channel A - SET */
} TC0_FOC0A_t;

/* Force Output Compare for Channel B */
typedef enum TC0_FOC0B_enum
{
    TC0_FOC0B_CLEAR_gc = (0x00), /* Force Output Compare for Channel B - CLEAR */
    TC0_FOC0B_SET_gc   = (0x40), /* Force Output Compare for Channel B - SET */
} TC0_FOC0B_t;

/* Input Capture Interrupt Enable */
typedef enum TC0_ICIE0_enum
{
    TC0_ICIE0_CLEAR_gc = (0x00), /* Input Capture Interrupt Enable - CLEAR */
    TC0_ICIE0_SET_gc   = (0x20), /* Input Capture Interrupt Enable - SET */
} TC0_ICIE0_t;

/* Output Compare B Match Interrupt Enable */
typedef enum TC0_OCIE0B_enum
{
    TC0_OCIE0B_CLEAR_gc = (0x00), /* Output Compare B Match Interrupt Enable - CLEAR */
    TC0_OCIE0B_SET_gc   = (0x04), /* Output Compare B Match Interrupt Enable - SET */
} TC0_OCIE0B_t;

/* Output Compare A Match Interrupt Enable */
typedef enum TC0_OCIE0A_enum
{
    TC0_OCIE0A_CLEAR_gc = (0x00), /* Output Compare A Match Interrupt Enable - CLEAR */
    TC0_OCIE0A_SET_gc   = (0x02), /* Output Compare A Match Interrupt Enable - SET */
} TC0_OCIE0A_t;

/* Overflow Interrupt Enable */
typedef enum TC0_TOIE0_enum
{
    TC0_TOIE0_CLEAR_gc = (0x00), /* Overflow Interrupt Enable - CLEAR */
    TC0_TOIE0_SET_gc   = (0x01), /* Overflow Interrupt Enable - SET */
} TC0_TOIE0_t;

/* Input Capture Flag */
typedef enum TC0_ICF0_enum
{
    TC0_ICF0_CLEAR_gc = (0x00), /* Input Capture Flag - CLEAR */
    TC0_ICF0_SET_gc   = (0x20), /* Input Capture Flag - SET */
} TC0_ICF0_t;

/* Timer Output Compare Flag 0B */
typedef enum TC0_OCF0B_enum
{
    TC0_OCF0B_CLEAR_gc = (0x00), /* Timer Output Compare Flag 0B - CLEAR */
    TC0_OCF0B_SET_gc   = (0x04), /* Timer Output Compare Flag 0B - SET */
} TC0_OCF0B_t;

/* Timer Output Compare Flag 0A */
typedef enum TC0_OCF0A_enum
{
    TC0_OCF0A_CLEAR_gc = (0x00), /* Timer Output Compare Flag 0A - CLEAR */
    TC0_OCF0A_SET_gc   = (0x02), /* Timer Output Compare Flag 0A - SET */
} TC0_OCF0A_t;

/* Timer Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x01), /* Timer Overflow Flag - SET */
} TC0_TOV0_t;

/* Timer Synchronization Mode */
typedef enum TC0_TSM_enum
{
    TC0_TSM_CLEAR_gc = (0x00), /* Timer Synchronization Mode - CLEAR */
    TC0_TSM_SET_gc   = (0x80), /* Timer Synchronization Mode - SET */
} TC0_TSM_t;

