stevenj/avr-libc3/include/avr/io/attiny102.h
/* Watchdog Reset Flag */
#define CPU_WDRF_CLEAR_gc (0x00) /* Watchdog Reset Flag - CLEAR */
#define CPU_WDRF_SET_gc   (0x08) /* Watchdog Reset Flag - SET */


/* External Reset Flag */
#define CPU_EXTRF_CLEAR_gc (0x00) /* External Reset Flag - CLEAR */
#define CPU_EXTRF_SET_gc   (0x02) /* External Reset Flag - SET */


/* Power-on Reset Flag */
#define CPU_PORF_CLEAR_gc (0x00) /* Power-on Reset Flag - CLEAR */
#define CPU_PORF_SET_gc   (0x01) /* Power-on Reset Flag - SET */


/* Non-Volatile Memory Busy */
#define CPU_NVMBSY_CLEAR_gc (0x00) /* Non-Volatile Memory Busy - CLEAR */
#define CPU_NVMBSY_SET_gc   (0x80) /* Non-Volatile Memory Busy - SET */


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/* Break-Before-Make Mode Enable for PORTB */
#define PORTB_BBMB_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable for PORTB - CLEAR */
#define PORTB_BBMB_SET_gc   (0x02) /* Break-Before-Make Mode Enable for PORTB - SET */


/* Break-Before-Make Mode Enable for PORTA */
#define PORTA_BBMA_CLEAR_gc (0x00) /* Break-Before-Make Mode Enable for PORTA - CLEAR */
#define PORTA_BBMA_SET_gc   (0x01) /* Break-Before-Make Mode Enable for PORTA - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x02) /* Interrupt Sense Control 0 Bit 1 - SET */


/* Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_CLEAR_gc (0x00) /* Interrupt Sense Control 0 Bit 0 - CLEAR */
#define EXINT_ISC00_SET_gc   (0x01) /* Interrupt Sense Control 0 Bit 0 - SET */


/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x01) /* External Interrupt Request 0 Enable - SET */


/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x01) /* External Interrupt Flag 0 - SET */


/* Pin Change Interrupt Enable 1 */
#define EXINT_PCIE1_CLEAR_gc (0x00) /* Pin Change Interrupt Enable 1 - CLEAR */
#define EXINT_PCIE1_SET_gc   (0x02) /* Pin Change Interrupt Enable 1 - SET */


/* Pin Change Interrupt Enable 0 */
#define EXINT_PCIE0_CLEAR_gc (0x00) /* Pin Change Interrupt Enable 0 - CLEAR */
#define EXINT_PCIE0_SET_gc   (0x01) /* Pin Change Interrupt Enable 0 - SET */


/* Pin Change Interrupt Flag 1 */
#define EXINT_PCIF1_CLEAR_gc (0x00) /* Pin Change Interrupt Flag 1 - CLEAR */
#define EXINT_PCIF1_SET_gc   (0x02) /* Pin Change Interrupt Flag 1 - SET */


/* Pin Change Interrupt Flag 0 */
#define EXINT_PCIF0_CLEAR_gc (0x00) /* Pin Change Interrupt Flag 0 - CLEAR */
#define EXINT_PCIF0_SET_gc   (0x01) /* Pin Change Interrupt Flag 0 - SET */


/* Pin Change Enable Mask 1 Bit 3 */
#define EXINT_PCINT11_CLEAR_gc (0x00) /* Pin Change Enable Mask 1 Bit 3 - CLEAR */
#define EXINT_PCINT11_SET_gc   (0x08) /* Pin Change Enable Mask 1 Bit 3 - SET */


/* Pin Change Enable Mask 1 Bit 2 */
#define EXINT_PCINT10_CLEAR_gc (0x00) /* Pin Change Enable Mask 1 Bit 2 - CLEAR */
#define EXINT_PCINT10_SET_gc   (0x04) /* Pin Change Enable Mask 1 Bit 2 - SET */


/* Pin Change Enable Mask 1 Bit 1 */
#define EXINT_PCINT9_CLEAR_gc (0x00) /* Pin Change Enable Mask 1 Bit 1 - CLEAR */
#define EXINT_PCINT9_SET_gc   (0x02) /* Pin Change Enable Mask 1 Bit 1 - SET */


/* Pin Change Enable Mask 1 Bit 0 */
#define EXINT_PCINT8_CLEAR_gc (0x00) /* Pin Change Enable Mask 1 Bit 0 - CLEAR */
#define EXINT_PCINT8_SET_gc   (0x01) /* Pin Change Enable Mask 1 Bit 0 - SET */


/* Pin Change Enable Mask 0 Bit 7 */
#define EXINT_PCINT7_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 7 - CLEAR */
#define EXINT_PCINT7_SET_gc   (0x80) /* Pin Change Enable Mask 0 Bit 7 - SET */


/* Pin Change Enable Mask 0 Bit 6 */
#define EXINT_PCINT6_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 6 - CLEAR */
#define EXINT_PCINT6_SET_gc   (0x40) /* Pin Change Enable Mask 0 Bit 6 - SET */


/* Pin Change Enable Mask 0 Bit 5 */
#define EXINT_PCINT5_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 5 - CLEAR */
#define EXINT_PCINT5_SET_gc   (0x20) /* Pin Change Enable Mask 0 Bit 5 - SET */


/* Pin Change Enable Mask 0 Bit 4 */
#define EXINT_PCINT4_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 4 - CLEAR */
#define EXINT_PCINT4_SET_gc   (0x10) /* Pin Change Enable Mask 0 Bit 4 - SET */


/* Pin Change Enable Mask 0 Bit 3 */
#define EXINT_PCINT3_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 3 - CLEAR */
#define EXINT_PCINT3_SET_gc   (0x08) /* Pin Change Enable Mask 0 Bit 3 - SET */


/* Pin Change Enable Mask 0 Bit 2 */
#define EXINT_PCINT2_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 2 - CLEAR */
#define EXINT_PCINT2_SET_gc   (0x04) /* Pin Change Enable Mask 0 Bit 2 - SET */


/* Pin Change Enable Mask 0 Bit 1 */
#define EXINT_PCINT1_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 1 - CLEAR */
#define EXINT_PCINT1_SET_gc   (0x02) /* Pin Change Enable Mask 0 Bit 1 - SET */


/* Pin Change Enable Mask 0 Bit 0 */
#define EXINT_PCINT0_CLEAR_gc (0x00) /* Pin Change Enable Mask 0 Bit 0 - CLEAR */
#define EXINT_PCINT0_SET_gc   (0x01) /* Pin Change Enable Mask 0 Bit 0 - SET */


/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Input Capture Noise Canceler */
#define TC0_ICNC0_CLEAR_gc (0x00) /* Input Capture Noise Canceler - CLEAR */
#define TC0_ICNC0_SET_gc   (0x80) /* Input Capture Noise Canceler - SET */


